ИС_СПОРТ_2022/src/InformationRegisters/СтатусыЗаявленияНаПриемВСпортивноеУчреждение/СтатусыЗаявленияНаПриемВСпортивноеУчреждение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыЗаявленияНаПриемВСпортивноеУчреждение</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СтатусЗаявления</name>
    <type>
      <types>EnumRef.СтатусыЗаявленийНаПриемВСпортивноеУчреждение</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Заявление</name>
    <type>
      <types>DocumentRef.ЗаявленияНаПриемВСпортивноеУчреждение</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИС_СПОРТ_2022/src/CommonModules/РаботаСоСтатусамиДокументов/Module.bsl
Процедура УстановитьСтатусЗаявления(ПереданныйДокумент,ВыбранноеЗначение) Экспорт
    

    Если ПереданныйДокумент.СтатусЗаявления <> ВыбранноеЗначение Тогда
        
        Если ТипЗнч(ПереданныйДокумент) = Тип("ДокументОбъект.ЗаявленияНаПриемВСпортивноеУчреждение") Тогда
            
            Документ = ПереданныйДокумент;
            ДокументСсылка = ПереданныйДокумент.Ссылка;
            
        ИначеЕсли ТипЗнч(ПереданныйДокумент) = Тип("ДокументСсылка.ЗаявленияНаПриемВСпортивноеУчреждение") Тогда
            
            Документ = ПереданныйДокумент.ПолучитьОбъект();
            ДокументСсылка = ПереданныйДокумент;
            
        Иначе 
            
            Возврат;
            
        КонецЕсли; 
        
        
        Документ.СтатусЗаявления = ВыбранноеЗначение;
        Документ.Записать(РежимЗаписиДокумента.Запись);
        
        МенеджерЗаписиСтатусДокумента = РегистрыСведений.СтатусыЗаявленияНаПриемВСпортивноеУчреждение.СоздатьМенеджерЗаписи();
        МенеджерЗаписиСтатусДокумента.Заявление = ДокументСсылка;
        МенеджерЗаписиСтатусДокумента.СтатусЗаявления = ВыбранноеЗначение;
        МенеджерЗаписиСтатусДокумента.Период = ТекущаяДатаСеанса();
        ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
        МенеджерЗаписиСтатусДокумента.Пользователь = ТекПользователь;
        МенеджерЗаписиСтатусДокумента.Записать();
        
    КонецЕсли;
    
КонецПроцедуры
